'use strict';

const res_1 = '' + 2 + 0;
console.log('res_1: ', res_1);
// Сложение со строкой "" + 2 преобразует 2 к строке: "" + 2 = "2", и в
// следующем  случае "2" + 0 работает то же самое правило

const res_2 = '' - 2 + 0;
console.log('res_2: ', res_2);
// Вычитание работает только с числами, пустая строка "" приводится к 0

const res_3 = '4' > '22';
console.log('res_3: ', res_3);
// строки сравниваются посимвольно
// Сначала сравниваются первые символы строк
// Если первый символ первой строки больше (меньше), чем первый символ второй, то первая строка больше (меньше) второй. Сравнение завершено
// Если первые символы равны, то таким же образом сравниваются уже вторые символы строк
// Сравнение продолжается, пока не закончится одна из строк
// Если обе строки заканчиваются одновременно, то они равны. Иначе, большей считается более длинная строка

const res_4 = 4 + 7 + 'px';
console.log('res_4: ', res_4);
// cначала произошло сложение чисел затем добавилась строка

const res_5 = '3px' - 5;
console.log('res_5: ', res_5);
// строка не является числом

const res_6 = '30px' + '50px';
console.log('res_6: ', res_6);
// если бинарный оператор '+' применить к строкам, то он их объединяет в одну

const res_7 = '50px' - '30px';
console.log('res_7: ', res_7);
// строка не является числом
